import React, { useContext }  from 'react';
import { OrdersContext } from '../OrdersContext';
import Header from '../Header';
import classes from '../../index.css';
import Footer from "../Footer";

const About = () => {
  const { orders, removeFromCart } = useContext(OrdersContext);

  return (
    <div className={classes}>

<div className="pageBody">
<Header orders={orders} onDelete={removeFromCart} showPresentation={false} />

<div className='aboutAutor'>
<h2>Скорик Анна Леонідівна</h2>
   

     <p>украiнська поетеса та кандидат технічних наук, член Творчої асоціації літераторів "Слобожанщина" з 2014 р. 
     <br />Закінчила Харківський державний технічний університет будівництва та архітектури. Здобула двi вищi освiти, успiшно закiнчила аспiрантуру. </p>

<h3>Жанри:</h3> християнські та ліричні вірші, вірші для дітей.
<h3>Літературні нагороди:</h3>
<ul>
  <li>
  творчість відзначена почесним дипломом Міжнародної спільноти письменницьких спілок, Міжрегіональної спілки письменників України та Конгресу літераторів України "За внесок у розвиток літературного процесу в Україні", 2012 р.;
  </li>
  <li>
  переможець всеукраїнського пісенно-поетичного турніру «Лицарі слова-2012» у номінації «Любовна та пейзажна лірика»;
  </li>
  <li>
  лауреат міжнародного конкурсу «У стінах срібного віку – 2012» у номінації «За радість, подаровану дітям» (м.Васильівка Запорізької обл.);
  </li>
  <li>
  переможець V-ого Міжнародного літературного фестивалю «Чеховська осінь» м. Ялти (Крим) у номінації «Вірші для дітей», 2012 р.
  </li>
  <li>
  переможець Всеукраїнського літературного фестивалю "Пушкінське кільце-2012";
  </li>
  <li>
  переможець 1-го заочного туру V ювілейного всеукраїнського турніру поетів "Пушкін в Одесі";
  </li>
  <li>
  дипломант мiждународного конкурсу «АВАЛгард», 2012г.

  </li>
</ul>
</div>
<Footer /> 
      </div>
 </div>
  
  )
}    
  export default About;

